Tekla.Structures.Model.BentPlate.BendShape
Enumerator to define different possibilities for bend shapes.

Tekla.Structures.Model.BentPlate.BendShape.Cylindrical
Cylindrical bend.

Tekla.Structures.Model.BentPlate.BendShape.Conical
Conical bend.